frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        $user->id_rol = 0;
        $user->id_perfil = 0;
        return $user->save() && $this->sendEmail($user);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `id_rol`, `id_perfil`, `status`, `created_at`, `updated_at`) VALUES ('Darwin', 'darwin@gmail.com', '$2y$13$oW0j3/RwfRg.k.wjxs/Su.Fpg.OXuAKZKMX1uXCb5iQCzBaR53ksi', '6D_hF8Wvi2OEtMRICTmG4LbbMhwO16ND', 'hcdAk_o-LAP-nUka-Qrn0ETJrPF_FKz0_1636556011', 0, 0, 9, 1636556011, 1636556011)